OpenFOAM-v2112-AD/tutorials/compressible/overRhoSimpleFoam/hotCylinder/cylinderAndBackground/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $temperature;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            fixedValue;
        value           uniform 450;
    }

    inlet
    {
        type            fixedValue;
        value           uniform $temperature;
    }

    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    ".*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
